{"sections":{"main":{"type":"main-page","disabled":true,"custom_css":[],"settings":{}},"77e98193-2825-47c0-81e5-6edca7a56fd8":{"type":"rich-text","blocks":{"template--21608289468714__77e98193-2825-47c0-81e5-6edca7a56fd8-text-1":{"type":"text","settings":{"enlarge_text":true,"text":"<p>House of Diamonds is devoted to delivering sustainable, just, and ethically crafted fine jewellery to our clientele. We pledge to never offer gemstones that have supported armed rebel movements or activities that contribute to human suffering.<\/p>"}},"template--21608289468714__77e98193-2825-47c0-81e5-6edca7a56fd8-heading-1":{"type":"heading","settings":{"title":""}}},"block_order":["template--21608289468714__77e98193-2825-47c0-81e5-6edca7a56fd8-text-1","template--21608289468714__77e98193-2825-47c0-81e5-6edca7a56fd8-heading-1"],"settings":{"align_text":"center","narrow_column":true,"divider":false}},"203ad26e-c061-457f-924b-52ab6ca214cf":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/rough_diamond_2.jpg","image_mask":"square","image2":"shopify:\/\/shop_images\/diamond_rough.png","image2_mask":"square","subtitle":"","title":"How do diamonds form?","text":"<p>Diamonds, consisting of pure carbon, are naturally occurring gems located within the Earth's surface. Formed deep within the Earth's mantle, approximately 150 kilometers below the planet's crust, natural diamonds develop within a high-pressure environment where temperatures soar above 1000 degrees Celsius.<br\/><br\/>Under these extreme conditions, carbon atoms undergo crystallization, initiating the formation of the initial diamond seed. The exact duration required for a diamond to develop remains uncertain, with scientists estimating a range from a few days to potentially millions of years. These natural diamonds, typically nestled within significant rock masses called xenoliths, are eventually propelled to the Earth's surface due to seismic activities such as volcanic eruptions.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"50","layout":"right","divider":false,"top_padding":true,"bottom_padding":true,"lazyload_images":true}},"173b9df7-0ca8-40be-8731-b9b196a7cdd5":{"type":"text-with-icons","blocks":{"template--21608203419946__173b9df7-0ca8-40be-8731-b9b196a7cdd5-text_block-1":{"type":"text_block","settings":{"icon":"globe","title":"Conflict Diamonds","text":"<p>Sourced globally, natural diamonds, although small, carry substantial value and have long been embroiled in trade disputes. Historically, unregulated diamond mining led to the creation of 'blood' or 'conflict' diamonds, mainly originating from African war zones. The mining involves forced labor and profits fund armed rebel groups.<\/p><p>The Kimberley Process, initiated in 2003, aimed to certify conflict-free diamonds for consumers. Despite its efforts to reduce conflict diamonds, loopholes persist nearly two decades later, enabling the international sale of diamonds mined in war zones. Concerns exist over the limited definition, focusing solely on mining and distribution while overlooking worker exploitation, health and safety concerns, child labor, fair wages, and the displacement of communities from their ancestral lands for new mining operations.<\/p>"}},"template--21608203419946__173b9df7-0ca8-40be-8731-b9b196a7cdd5-text_block-2":{"type":"text_block","settings":{"icon":"shield","title":"Lab Created Diamonds","text":"<p>Modern technology enables the production of lab-grown diamonds in a controlled setting. Simulating the intense heat and pressure of the Earth’s mantle, these diamonds possess identical physical, chemical, and optical properties as natural diamonds. The process involves the seeds maturing within a pressure chamber for 6-10 weeks following crystallization. Notably, lab-grown diamonds offer the same appearance and quality as natural diamonds while ensuring a 100% conflict-free origin. Traceable and devoid of mining, environmental harm, community displacement, or unethical labor practices, they stand out for their ethical production.<\/p><p>Consider this: Mining approximately 250 tons of earth is necessary to find just one carat of diamond. Lab-grown diamonds circumvent mining, minimizing their environmental impact in comparison to natural diamonds. Opting for lab-grown diamonds ensures a conflict-free choice, distinguishing them as an ethical and environmentally conscious alternative.<\/p>"}},"text_block_YUBTNE":{"type":"text_block","settings":{"icon":"trophy","title":"Our Difference","text":"<p>At House of Diamonds, every piece of diamond jewellery we create is not only beautiful but also ethically sourced. We are committed to offering conflict-free, responsibly sourced diamonds that reflect our core values of transparency, human dignity, and environmental stewardship.<\/p><p>We go beyond basic compliance such as The Kimberly Process, working only with trusted suppliers who provide clear traceability, fair labor practices, and verifiable sourcing transparency.<\/p><p>We prioritise diamonds from countries with robust labor and environmental protections and maintain strict sourcing standards for diamonds cut and polished in India by partnering only with audited, certified manufacturers (e.g., RJC, ISO, and SA8000 certified).<\/p><p>Our promise is simple: whether lab-grown or natural, every diamond we offer is selected with integrity — conflict-free, low-impact, and ethically aligned with our commitment to people and the planet.<\/p>"}}},"block_order":["template--21608203419946__173b9df7-0ca8-40be-8731-b9b196a7cdd5-text_block-1","template--21608203419946__173b9df7-0ca8-40be-8731-b9b196a7cdd5-text_block-2","text_block_YUBTNE"],"settings":{"title":"","align_text":"center","desktop_columns_per_row":3,"icon_color":"#000000","button_label":"","button_link":"","divider":false}},"2373b609-44af-4f10-9977-cf5f34e757f2":{"type":"faq","blocks":{"010e42ad-b3ec-4728-b21c-59773633f629":{"type":"rich-text","settings":{"title":"Client Care FAQ","text":"","align_text":"left"}},"template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-1":{"type":"question","settings":{"title":"How long will it take to craft my ring?","text":"<p>All our rings are made to order and are usually ready in 20-30 business days. If you need a ring urgently, ask about our ready to ship rings.<\/p>"}},"template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-2":{"type":"question","settings":{"title":"Can you help me place an order online?","text":"<p>If you need help placing an online order, please <a href=\"https:\/\/cullenjewellery.com\/contact\">contact us here<\/a> and one we will assist you.<\/p>"}},"6efa18b3-a133-46e6-a7dc-9fe05a0f8452":{"type":"question","settings":{"title":"What warranty do I receive?","text":"<p>In addition to the warranty received under law, House of Diamonds offers a free 10 year warranty from the date of invoice against any manufacturing defects on all gold and platinum jewellery. <a href=\"https:\/\/cullenjewellery.com\/warranty\" title=\"Cullen Jewellery Lifetime Warranty\">Read the full details about our warranty here<\/a>.<\/p>"}},"9c9b71c8-46a7-45a7-8ed5-1e72ffcb6c41":{"type":"question","settings":{"title":"Do you ship worldwide?","text":"<p>Yes, we offer free international shipping on all orders.<\/p>"}},"17b779a1-1a42-448a-8df2-631a7338a64e":{"type":"question","settings":{"title":"Can I see the jewellery in person before I buy?","text":"<p>Yes, you can schedule an appointment with us.<\/p>"}},"b8b0e61c-b56c-4eaa-8cc6-e518c98ae2cb":{"type":"question","settings":{"title":"Can you help me with my ring size?","text":"<p>We offer free ring sizers so you can measure your ring size in the comfort of your own home! Contact us to get yours and allow up to 5 working days for your free ring sizer to arrive.<\/p>"}},"7da333cb-df93-4c03-8994-1591cb40c77e":{"type":"question","settings":{"title":"Can you help me keep the purchase a secret?","text":"<p>Certainly! We acknowledge that a considerable number of our products are bought as unexpected gifts for occasions like engagements. <br\/><br\/>That's why we can employ discreet packaging that won't reveal the package's contents. If there's anything else we can assist you with to maintain the surprise of your purchase, please don't hesitate to inform us<\/p>"}},"3e67fa4b-adfc-4d32-9971-4f9d05de91eb":{"type":"question","settings":{"title":"What payment methods do you accept?","text":"<p>We accept payments via direct debit, cash or card. If you are looking for an extended payment plan, we also offer interest-free finance.<\/p>"}},"3b41e13c-b3c2-4a22-8b1e-f2ae8fc0b2b0":{"type":"question","settings":{"title":"Can I return a product?","text":"<p>Our rings are custom made to order and they cannot be returned. Please choose carefully when purchasing. If you have a question or require assistance, please contact us.<\/p>"}},"cc08a438-1c5c-4e1d-ab30-199d6666249c":{"type":"question","settings":{"title":"Can you re-size my ring?","text":"<p>Yes, please contact us and we will assist you in re-sizing.<\/p>"}},"ae96eb5e-bc4b-4a88-9f5f-3d7ff87363f7":{"type":"rich-text","settings":{"title":"Lab Grown Diamond FAQ","text":"","align_text":"left"}},"e16d09fe-6a67-4026-930f-278cf8c5142f":{"type":"question","settings":{"title":"Are lab grown diamonds real diamonds?","text":"<p>Absolutely! Lab-grown diamonds possess the same authenticity as mined diamonds. <br\/><br\/>They share identical optical, chemical, thermal, and physical properties. The sole variance between lab-grown and mined diamonds is their source. <br\/><br\/>Lab-grown diamonds are cultivated within controlled laboratory settings that replicate the pressure and heat conditions responsible for the formation of mined diamonds within the Earth's crust.<\/p>"}},"39c62c93-cc65-406f-8f9b-e2807c6016bc":{"type":"question","settings":{"title":"Simulant diamonds VS lab-grown diamonds?","text":"<p>A lab-grown diamond shares identical chemical and physical properties with a naturally formed diamond, whereas a simulant is crafted from a different material aiming to imitate the appearance of a diamond. <br\/><br\/>Cubic zirconia, a prominent simulant, is composed of zirconium dioxide, a comparatively soft substance. Simulant diamonds do not endure as long as genuine diamonds and usually require replacement every few years. In contrast, lab-grown diamonds are essentially diamonds, differing solely in their origin. <br\/><br\/>Both lab-grown and mined diamonds are composed of pure carbon and boast a hardness rating of 10 on the Mohs hardness scale. Therefore, a lab-grown diamond possesses the same durability and lifespan as a mined diamond.<\/p>"}},"ee1a2469-eea6-4c3c-b5d9-5eecc35787d7":{"type":"question","settings":{"title":"Mined diamonds VS lab-grown diamonds?","text":"<p>The sole distinction between a mined diamond and a lab-grown diamond is their source.<br\/>Mined diamonds originate from the Earth's crust, formed under intense heat and pressure, and extracted through mining.<\/p><p>Conversely, lab diamonds are cultivated under identical conditions to mined diamonds, albeit within a controlled laboratory environment, eliminating the necessity for traditional mining practices. <\/p><p>With identical chemical, physical, and optical properties, the primary divergence remains that mined diamonds are obtained through mining, while lab-grown diamonds are not. This attribute positions lab diamonds as an ethical, eco-friendly, and sustainable option.<\/p>"}},"469fc449-cc49-4034-87ff-0db6e763cd6b":{"type":"question","settings":{"title":"Are lab grown diamonds ethical?","text":"<p>As lab-grown diamonds are cultivated in controlled laboratory settings, they eliminate the necessity for extraction from the earth, distinguishing them from mined diamonds. This absence of mining significantly diminishes the environmental impact and eliminates the potential for unethical labor practices and community displacement.<\/p>"}},"5c9971da-8934-4064-9f28-b0e278677938":{"type":"question","settings":{"title":"Are lab grown diamonds less flawed?","text":"<p>Similar to their mined equivalents, each lab-created diamond possesses its own unique characteristics. Grown under analogous intense heat and pressure as mined diamonds, a lab-grown diamond undergoes a comparable growth process and might exhibit minor internal or surface imperfections, akin to those found in mined diamonds. <br\/><br\/>Consequently, every lab-grown diamond will exhibit variations in color, clarity, and cut. Leading gemological institutions like IGI and GIA meticulously evaluate and certify each individual lab-created diamond, employing the same stringent standards applied to mined diamonds.<\/p>"}},"9027b5e1-5ddb-4ad2-8489-eea925695c6b":{"type":"question","settings":{"title":"Do lab grown diamonds pass diamond testers?","text":"<p>Certainly! Lab-grown diamonds are detectable by a diamond tester. As they consist of pure carbon and exhibit identical thermal conductivity and chemical properties to natural diamonds, they will yield a positive result when tested using a diamond tester.<\/p>"}},"6d0302ff-58ba-4768-9382-17eb7b8447a3":{"type":"question","settings":{"title":"Are our diamonds certified?","text":"<p>Certainly! Each of our lab-grown diamonds undergoes assessment based on cut, clarity, color, and carat weight and holds certification from IGI or GIA. The majority of our lab-grown diamonds are certified by IGI, the foremost gemological institute in the lab-grown diamond sector. IGI stands as a widely recognized certifier for lab-created diamonds, fostering a standardized grading system throughout the industry. This consistency in grading enables consumers to readily compare lab-grown diamonds, ensuring confidence in the quality and value of their purchase.<\/p>"}},"43a59512-0cd7-4474-a0bf-f55e6d1a9a59":{"type":"question","settings":{"title":"Are lab grown diamonds conflict free?","text":"<p>Lab-grown diamonds are cultivated in controlled laboratory settings, eliminating the necessity for mining from the earth. The unique advantage of lab-created diamonds is their potential to be entirely conflict-free. In contrast, determining the origins of mined diamonds and discerning whether unsafe or unethical labor practices were involved in their extraction from the earth is considerably challenging, if not nearly impossible.<\/p>"}},"5e564c17-cc15-448c-9762-a96cb957b0fd":{"type":"question","settings":{"title":"Are lab grown diamonds really eco-friendly?","text":"<p>Lab-grown diamonds stand as the environmentally conscious substitute for mined diamonds. Consider this: mining just 1 carat of mined diamond requires the movement of over 250 tons of ore. By negating the necessity for mining, lab-grown diamonds significantly diminish the detrimental environmental impact, guaranteeing that mined habitats, wildlife, and ancestral communities remain unharmed in their production process.<\/p>"}},"6487c65c-8653-4789-82bb-c8084e5514c6":{"type":"question","settings":{"title":"Do you also sell natural diamonds?","text":"<p>Yes, we can provide natural diamonds. However, our dedication lies in providing exclusively conflict-free diamonds. With lab-created diamonds, we can ensure a complete traceability to their origin, enabling us to consistently deliver ethical and environmentally friendly jewelry to our clients.<\/p>"}}},"block_order":["010e42ad-b3ec-4728-b21c-59773633f629","template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-1","template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-2","6efa18b3-a133-46e6-a7dc-9fe05a0f8452","9c9b71c8-46a7-45a7-8ed5-1e72ffcb6c41","17b779a1-1a42-448a-8df2-631a7338a64e","b8b0e61c-b56c-4eaa-8cc6-e518c98ae2cb","7da333cb-df93-4c03-8994-1591cb40c77e","3e67fa4b-adfc-4d32-9971-4f9d05de91eb","3b41e13c-b3c2-4a22-8b1e-f2ae8fc0b2b0","cc08a438-1c5c-4e1d-ab30-199d6666249c","ae96eb5e-bc4b-4a88-9f5f-3d7ff87363f7","e16d09fe-6a67-4026-930f-278cf8c5142f","39c62c93-cc65-406f-8f9b-e2807c6016bc","ee1a2469-eea6-4c3c-b5d9-5eecc35787d7","469fc449-cc49-4034-87ff-0db6e763cd6b","5c9971da-8934-4064-9f28-b0e278677938","9027b5e1-5ddb-4ad2-8489-eea925695c6b","6d0302ff-58ba-4768-9382-17eb7b8447a3","43a59512-0cd7-4474-a0bf-f55e6d1a9a59","5e564c17-cc15-448c-9762-a96cb957b0fd","6487c65c-8653-4789-82bb-c8084e5514c6"],"disabled":true,"settings":{"title":""}},"16928631707f369cea":{"type":"apps","settings":{"full_width":false,"space_around":true}},"83b79a83-0f36-4b69-8d1c-f7817ec66957":{"type":"rich-text","blocks":{"template--19232481345834__83b79a83-0f36-4b69-8d1c-f7817ec66957-heading-1":{"type":"heading","settings":{"title":""}}},"block_order":["template--19232481345834__83b79a83-0f36-4b69-8d1c-f7817ec66957-heading-1"],"settings":{"align_text":"center","narrow_column":true,"divider":false}}},"order":["main","77e98193-2825-47c0-81e5-6edca7a56fd8","203ad26e-c061-457f-924b-52ab6ca214cf","173b9df7-0ca8-40be-8731-b9b196a7cdd5","2373b609-44af-4f10-9977-cf5f34e757f2","16928631707f369cea","83b79a83-0f36-4b69-8d1c-f7817ec66957"]}