{"sections":{"main":{"type":"main-page","custom_css":[],"settings":{}},"4bffbcf5-e347-4a54-b8ae-f190fb314ccf":{"type":"text-and-image","disabled":true,"settings":{"image":"shopify:\/\/shop_images\/20231112_130201_1.jpg","image_mask":"rounded","image2":"shopify:\/\/shop_images\/igi-lab-grown-diamond-certificate.jpg","image2_mask":"none","subtitle":"","title":"What is a lab grown diamond certification?","text":"<p>A lab grown diamond certification is a document generated by an impartial third-party laboratory, such as IGI or GIA, providing an unbiased report on a diamond's attributes. This lab, having no vested interest in the diamond's sale, assesses the gem based on its inherent qualities, detailing its appearance and distinctive characteristics objectively.<\/p><p>Every lab-grown diamond is expected to be accompanied by a certification. Skilled jewelers meticulously scrutinize and measure the diamond using tools like a loupe or microscope, recording their observations on the certificate. This official document outlines the stone's diverse features, encompassing details such as cut, color, and clarity grade.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"50","layout":"right","divider":false,"top_padding":true,"bottom_padding":true,"lazyload_images":true}},"b239b35c-05b8-43a1-8edc-d029f10cf224":{"type":"rich-text","blocks":{"template--19232481345834__b239b35c-05b8-43a1-8edc-d029f10cf224-heading-1":{"type":"heading","settings":{"title":"What is an IGI certification?"}},"template--19232481345834__b239b35c-05b8-43a1-8edc-d029f10cf224-text-1":{"type":"text","settings":{"enlarge_text":false,"text":"<p>The International Gemological Institute stands out as the top certification for lab-created diamonds, offering precise gradings for the four C's—cut, color, clarity, and carat weight. IGI holds the position as the most widely recognized certifier in the lab-created diamond market, ensuring a standardized grading system across the industry. This uniformity enables consumers to effortlessly compare lab-grown diamonds, providing them with confidence that they are receiving the value they expect for their purchase.<\/p>"}}},"block_order":["template--19232481345834__b239b35c-05b8-43a1-8edc-d029f10cf224-heading-1","template--19232481345834__b239b35c-05b8-43a1-8edc-d029f10cf224-text-1"],"disabled":true,"settings":{"align_text":"left","narrow_column":false,"divider":false}},"a7ce055c-5c93-4b0a-b676-b2208e052668":{"type":"rich-text","blocks":{"ac322981-1908-4641-912d-f0efc019fd9b":{"type":"heading","settings":{"title":"What is a GIA certification?"}},"6e7a657c-efd7-47cc-b1cf-5b59f35eba1d":{"type":"text","settings":{"enlarge_text":false,"text":"<p>The Gemological Institute of America (GIA) stands as the most esteemed diamond grading authority globally, recognized for its consistent grading standards and considered the pinnacle of certification in the natural diamond industry.<\/p><p>However, the GIA has only recently initiated the grading of lab-created diamonds. As a result, there is a limited availability of GIA-graded lab-grown diamonds, with the majority of lab-grown diamonds being graded by the IGI. Given that an IGI certification is widespread and encompasses all the necessary specifications for a reliable comparison of lab-grown diamonds, we recommend seeking out an IGI certified lab-grown diamond.<\/p><p>At House of Diamonds, our lab-grown diamonds predominantly carry an IGI certification, accompanied by an IGI Laboratory Grown Diamond Report. Additionally, each IGI-graded stone is laser-inscribed with the report number and the words \"lab grown\" or 'LG' standing for lab grown in front of the number inscribed, to provide you with assurance. This inscription is discreet and not visible to the naked eye, requiring a jeweler's loupe for viewing, ensuring it has no impact on your diamond's quality or light performance.<\/p>"}}},"block_order":["ac322981-1908-4641-912d-f0efc019fd9b","6e7a657c-efd7-47cc-b1cf-5b59f35eba1d"],"disabled":true,"settings":{"align_text":"left","narrow_column":false,"divider":false}},"61aa108e-d5a0-4743-990c-a13cbcfe4f94":{"type":"rich-text","blocks":{"template--19232481345834__61aa108e-d5a0-4743-990c-a13cbcfe4f94-heading-1":{"type":"heading","settings":{"title":""}},"template--19232481345834__61aa108e-d5a0-4743-990c-a13cbcfe4f94-text-1":{"type":"text","settings":{"enlarge_text":false,"text":"<h2>The 4 C's<\/h2><p><br\/>The colour of a diamond refers to its degree of whiteness or yellowness. Higher quality diamonds are typically colourless, while lower quality diamonds may have a slight yellow tint. When choosing the colour of your diamond, consider the shape and the metal it will be set in. For example, for white metals like platinum or white gold, we recommend selecting a colour grade between D and G. However, if you are setting the diamond in yellow or rose gold, you can go as low as a J colour since the metal's reflection tends to conceal colour traces. In the case of elongated diamonds with shallow cuts, such as oval and pear shapes, it's advisable to stay within the D-G colour range.<\/p><h3>Clarity:<\/h3><p>Clarity refers to the presence of natural imperfections in diamonds, such as internal air bubbles and markings. As you move up in clarity grades, these imperfections become less visible to the naked eye. Clarity is assessed using a 10x magnification loupe, where any visible imperfections are noted and graded accordingly. We recommend not choosing a clarity grade lower than SI2. However, it's important to note that not all SI2 clarity diamonds are eye clean, as some may have large black inclusions visible without a loupe. Our general recommendation is usually within the FL-SI1 clarity range, depending on the client's specific requirements. For the best value for money, consider diamonds with a clarity grade between VS2 and SI1, as they offer high quality without the price of a flawless diamond.<\/p><h3>Cut:<\/h3><p>Cut grades are specifically assigned to brilliant cut (round) diamonds, while other shapes receive polish and symmetry grades. For brilliant cut diamonds, we recommend a triple excellent grading, which signifies excellent cut, polish, and symmetry. This combination maximizes the diamond's fire and brilliance.<\/p><h3>Carat:<\/h3><p>Carat is the unit of measurement for a diamond's physical weight. While carat weight is important, especially for those seeking a specific size, the diamond's measurements are also crucial. The cut of the stone can influence how large it appears. For elongated shapes like oval or pear cuts, the ratio of length to width is vital. By choosing the right ratio, you can achieve a larger-looking diamond without necessarily increasing the carat weight. Consider the shape and proportions of the stone to make an informed decision.<\/p><h2>Fluorescence:<\/h2><p>Fluorescence is a chemical property present in some diamonds. It is only visible under blue UV light and does not affect the diamond's fire or luster in regular lighting conditions. Diamonds without fluorescence tend to have higher price tags as they are rarer. However, diamonds with fluorescence can offer excellent quality while fitting within your budget. Fluorescence is graded on a scale of Nil, Faint, Medium, Strong, and Very Strong.<\/p><h2>Elongated Diamond Ratio vs Carat Weight:<\/h2><p>For oval, pear, radiant, emerald, and marquise-shaped diamonds, the ratio of length to width is an important factor to consider. A specific ratio can help maximize the overall appearance of the diamond without paying for a higher carat weight. Different ratios are recommended for different shapes to achieve the desired visual effect.<\/p><h2>Natural Diamonds and Laboratory Grown:<\/h2><p>The choice between natural diamonds and laboratory-grown diamonds depends on personal preference. Natural diamonds are mined from the earth and are considered one-of-a-kind. Laboratory-grown diamonds have the same chemical composition as natural diamonds and are mass-produced, resulting in lower prices. They are 100% identical to the human eye, and contain the same fire, sparkle and brilliance as an earth created stone. The subtle differences are microscopic and only the most trained gemologists in the world can determine the difference. Lab-grown diamonds can only be differentiated from natural diamonds using a microscope due to the absence of nitrogen in their composition, a characteristic present in natural diamonds.<\/p><h2>Natural Diamonds vs Laboratory-Grown:<\/h2><p>The question of \"Natural vs Lab-Grown diamonds. Which is better?\" is frequently asked, and we believe that the answer depends on individual preferences. Some clients appreciate the uniqueness of natural diamonds, which are mined from the earth, while others are satisfied with lab-grown diamonds that have the same chemical composition as natural ones but at a lower price. The key distinction is that lab-grown diamonds are mass-produced and therefore less rare, resulting in a lower value. Natural diamonds, on the other hand, are rare and their value is expected to increase over time. However, most natural stones only retain about 40-50% of their purchase price, but come at a much larger price point. The choice will come down to your budget and personal preference.<\/p><h2>Ring Sizing and Fit:<\/h2><p>After making a purchase, we highly recommend requesting one of our ring sizing kits if you are unsure about selecting the right ring size. The ring should slide onto your finger comfortably without feeling too tight. If you need to exert significant force to remove the ring, it indicates that it is too large. We offer the first resize for free if the difference is within 2-3 sizes from the size it was initially ordered.<\/p><h2>'Eye Clean' and Diamond Inclusions:<br\/><\/h2><p>The term 'Eye Clean' refers to a diamond that doesn't have visible inclusions when observed with the naked eye. At House of Diamonds, we strive to sell only eye clean diamonds, and we have implemented filters in our online diamond stock to ensure high-grade quality. However, this method is not foolproof, so if you are uncertain about a diamond, please contact our team to confirm its eye clean status and suitability for you. Additionally, we want to emphasize the importance of avoiding \"milky\" or \"cloudy\" diamonds. These diamonds have inclusions that create a hazy appearance, and we do not work with such diamonds or those with any hint of colour. Although this isn't a technical grading term found on certificates, it plays a crucial role in selecting a diamond. To maintain the highest quality, our inventory excludes diamonds with milky, cloudy, or coloured tinges.<\/p>"}}},"block_order":["template--19232481345834__61aa108e-d5a0-4743-990c-a13cbcfe4f94-heading-1","template--19232481345834__61aa108e-d5a0-4743-990c-a13cbcfe4f94-text-1"],"disabled":true,"settings":{"align_text":"center","narrow_column":true,"divider":false}},"2373b609-44af-4f10-9977-cf5f34e757f2":{"type":"faq","blocks":{"010e42ad-b3ec-4728-b21c-59773633f629":{"type":"rich-text","settings":{"title":"Client Care FAQ","text":"","align_text":"left"}},"template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-1":{"type":"question","settings":{"title":"How long will it take to craft my ring?","text":"<p>All our rings are made to order and are usually ready in 20-30 business days. If you need a ring urgently, ask about our ready to ship rings.<\/p>"}},"template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-2":{"type":"question","settings":{"title":"Can you help me place an order online?","text":"<p>If you need help placing an online order, please <a href=\"https:\/\/cullenjewellery.com\/contact\">contact us here<\/a> and one we will assist you.<\/p>"}},"6efa18b3-a133-46e6-a7dc-9fe05a0f8452":{"type":"question","settings":{"title":"What warranty do I receive?","text":"<p>In addition to the warranty received under law, House of Diamonds offers a free 10 year warranty from the date of invoice against any manufacturing defects on all gold and platinum jewellery. <a href=\"https:\/\/cullenjewellery.com\/warranty\" title=\"Cullen Jewellery Lifetime Warranty\">Read the full details about our warranty here<\/a>.<\/p>"}},"9c9b71c8-46a7-45a7-8ed5-1e72ffcb6c41":{"type":"question","settings":{"title":"Do you ship worldwide?","text":"<p>Yes, we offer free international shipping on all orders.<\/p>"}},"17b779a1-1a42-448a-8df2-631a7338a64e":{"type":"question","settings":{"title":"Can I see the jewellery in person before I buy?","text":"<p>Yes, you can schedule an appointment with us.<\/p>"}},"b8b0e61c-b56c-4eaa-8cc6-e518c98ae2cb":{"type":"question","settings":{"title":"Can you help me with my ring size?","text":"<p>We offer free ring sizers so you can measure your ring size in the comfort of your own home! Contact us to get yours and allow up to 5 working days for your free ring sizer to arrive.<\/p>"}},"7da333cb-df93-4c03-8994-1591cb40c77e":{"type":"question","settings":{"title":"Can you help me keep the purchase a secret?","text":"<p>Certainly! We acknowledge that a considerable number of our products are bought as unexpected gifts for occasions like engagements. <br\/><br\/>That's why we can employ discreet packaging that won't reveal the package's contents. If there's anything else we can assist you with to maintain the surprise of your purchase, please don't hesitate to inform us<\/p>"}},"3e67fa4b-adfc-4d32-9971-4f9d05de91eb":{"type":"question","settings":{"title":"What payment methods do you accept?","text":"<p>We accept payments via direct debit, cash or card. If you are looking for an extended payment plan, we also offer interest-free finance.<\/p>"}},"3b41e13c-b3c2-4a22-8b1e-f2ae8fc0b2b0":{"type":"question","settings":{"title":"Can I return a product?","text":"<p>Our rings are custom made to order and they cannot be returned. Please choose carefully when purchasing. If you have a question or require assistance, please contact us.<\/p>"}},"cc08a438-1c5c-4e1d-ab30-199d6666249c":{"type":"question","settings":{"title":"Can you re-size my ring?","text":"<p>Yes, please contact us and we will assist you in re-sizing.<\/p>"}},"ae96eb5e-bc4b-4a88-9f5f-3d7ff87363f7":{"type":"rich-text","settings":{"title":"Lab Grown Diamond FAQ","text":"","align_text":"left"}},"e16d09fe-6a67-4026-930f-278cf8c5142f":{"type":"question","settings":{"title":"Are lab grown diamonds real diamonds?","text":"<p>Absolutely! Lab-grown diamonds possess the same authenticity as mined diamonds. <br\/><br\/>They share identical optical, chemical, thermal, and physical properties. The sole variance between lab-grown and mined diamonds is their source. <br\/><br\/>Lab-grown diamonds are cultivated within controlled laboratory settings that replicate the pressure and heat conditions responsible for the formation of mined diamonds within the Earth's crust.<\/p>"}},"39c62c93-cc65-406f-8f9b-e2807c6016bc":{"type":"question","settings":{"title":"Simulant diamonds VS lab-grown diamonds?","text":"<p>A lab-grown diamond shares identical chemical and physical properties with a naturally formed diamond, whereas a simulant is crafted from a different material aiming to imitate the appearance of a diamond. <br\/><br\/>Cubic zirconia, a prominent simulant, is composed of zirconium dioxide, a comparatively soft substance. Simulant diamonds do not endure as long as genuine diamonds and usually require replacement every few years. In contrast, lab-grown diamonds are essentially diamonds, differing solely in their origin. <br\/><br\/>Both lab-grown and mined diamonds are composed of pure carbon and boast a hardness rating of 10 on the Mohs hardness scale. Therefore, a lab-grown diamond possesses the same durability and lifespan as a mined diamond.<\/p>"}},"ee1a2469-eea6-4c3c-b5d9-5eecc35787d7":{"type":"question","settings":{"title":"Mined diamonds VS lab-grown diamonds?","text":"<p>The sole distinction between a mined diamond and a lab-grown diamond is their source.<br\/>Mined diamonds originate from the Earth's crust, formed under intense heat and pressure, and extracted through mining.<\/p><p>Conversely, lab diamonds are cultivated under identical conditions to mined diamonds, albeit within a controlled laboratory environment, eliminating the necessity for traditional mining practices. <\/p><p>With identical chemical, physical, and optical properties, the primary divergence remains that mined diamonds are obtained through mining, while lab-grown diamonds are not. This attribute positions lab diamonds as an ethical, eco-friendly, and sustainable option.<\/p>"}},"469fc449-cc49-4034-87ff-0db6e763cd6b":{"type":"question","settings":{"title":"Are lab grown diamonds ethical?","text":"<p>As lab-grown diamonds are cultivated in controlled laboratory settings, they eliminate the necessity for extraction from the earth, distinguishing them from mined diamonds. This absence of mining significantly diminishes the environmental impact and eliminates the potential for unethical labor practices and community displacement.<\/p>"}},"5c9971da-8934-4064-9f28-b0e278677938":{"type":"question","settings":{"title":"Are lab grown diamonds less flawed?","text":"<p>Similar to their mined equivalents, each lab-created diamond possesses its own unique characteristics. Grown under analogous intense heat and pressure as mined diamonds, a lab-grown diamond undergoes a comparable growth process and might exhibit minor internal or surface imperfections, akin to those found in mined diamonds. <br\/><br\/>Consequently, every lab-grown diamond will exhibit variations in color, clarity, and cut. Leading gemological institutions like IGI and GIA meticulously evaluate and certify each individual lab-created diamond, employing the same stringent standards applied to mined diamonds.<\/p>"}},"9027b5e1-5ddb-4ad2-8489-eea925695c6b":{"type":"question","settings":{"title":"Do lab grown diamonds pass diamond testers?","text":"<p>Certainly! Lab-grown diamonds are detectable by a diamond tester. As they consist of pure carbon and exhibit identical thermal conductivity and chemical properties to natural diamonds, they will yield a positive result when tested using a diamond tester.<\/p>"}},"6d0302ff-58ba-4768-9382-17eb7b8447a3":{"type":"question","settings":{"title":"Are our diamonds certified?","text":"<p>Certainly! Each of our lab-grown diamonds undergoes assessment based on cut, clarity, color, and carat weight and holds certification from IGI or GIA. The majority of our lab-grown diamonds are certified by IGI, the foremost gemological institute in the lab-grown diamond sector. IGI stands as a widely recognized certifier for lab-created diamonds, fostering a standardized grading system throughout the industry. This consistency in grading enables consumers to readily compare lab-grown diamonds, ensuring confidence in the quality and value of their purchase.<\/p>"}},"43a59512-0cd7-4474-a0bf-f55e6d1a9a59":{"type":"question","settings":{"title":"Are lab grown diamonds conflict free?","text":"<p>Lab-grown diamonds are cultivated in controlled laboratory settings, eliminating the necessity for mining from the earth. The unique advantage of lab-created diamonds is their potential to be entirely conflict-free. In contrast, determining the origins of mined diamonds and discerning whether unsafe or unethical labor practices were involved in their extraction from the earth is considerably challenging, if not nearly impossible.<\/p>"}},"5e564c17-cc15-448c-9762-a96cb957b0fd":{"type":"question","settings":{"title":"Are lab grown diamonds really eco-friendly?","text":"<p>Lab-grown diamonds stand as the environmentally conscious substitute for mined diamonds. Consider this: mining just 1 carat of mined diamond requires the movement of over 250 tons of ore. By negating the necessity for mining, lab-grown diamonds significantly diminish the detrimental environmental impact, guaranteeing that mined habitats, wildlife, and ancestral communities remain unharmed in their production process.<\/p>"}},"6487c65c-8653-4789-82bb-c8084e5514c6":{"type":"question","settings":{"title":"Do you also sell natural diamonds?","text":"<p>Yes, we can provide natural diamonds. However, our dedication lies in providing exclusively conflict-free diamonds. With lab-created diamonds, we can ensure a complete traceability to their origin, enabling us to consistently deliver ethical and environmentally friendly jewelry to our clients.<\/p>"}}},"block_order":["010e42ad-b3ec-4728-b21c-59773633f629","template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-1","template--19232481345834__2373b609-44af-4f10-9977-cf5f34e757f2-question-2","6efa18b3-a133-46e6-a7dc-9fe05a0f8452","9c9b71c8-46a7-45a7-8ed5-1e72ffcb6c41","17b779a1-1a42-448a-8df2-631a7338a64e","b8b0e61c-b56c-4eaa-8cc6-e518c98ae2cb","7da333cb-df93-4c03-8994-1591cb40c77e","3e67fa4b-adfc-4d32-9971-4f9d05de91eb","3b41e13c-b3c2-4a22-8b1e-f2ae8fc0b2b0","cc08a438-1c5c-4e1d-ab30-199d6666249c","ae96eb5e-bc4b-4a88-9f5f-3d7ff87363f7","e16d09fe-6a67-4026-930f-278cf8c5142f","39c62c93-cc65-406f-8f9b-e2807c6016bc","ee1a2469-eea6-4c3c-b5d9-5eecc35787d7","469fc449-cc49-4034-87ff-0db6e763cd6b","5c9971da-8934-4064-9f28-b0e278677938","9027b5e1-5ddb-4ad2-8489-eea925695c6b","6d0302ff-58ba-4768-9382-17eb7b8447a3","43a59512-0cd7-4474-a0bf-f55e6d1a9a59","5e564c17-cc15-448c-9762-a96cb957b0fd","6487c65c-8653-4789-82bb-c8084e5514c6"],"disabled":true,"settings":{"title":""}},"16928631707f369cea":{"type":"apps","settings":{"full_width":false,"space_around":true}},"83b79a83-0f36-4b69-8d1c-f7817ec66957":{"type":"rich-text","blocks":{"template--19232481345834__83b79a83-0f36-4b69-8d1c-f7817ec66957-heading-1":{"type":"heading","settings":{"title":""}}},"block_order":["template--19232481345834__83b79a83-0f36-4b69-8d1c-f7817ec66957-heading-1"],"settings":{"align_text":"center","narrow_column":true,"divider":false}}},"order":["main","4bffbcf5-e347-4a54-b8ae-f190fb314ccf","b239b35c-05b8-43a1-8edc-d029f10cf224","a7ce055c-5c93-4b0a-b676-b2208e052668","61aa108e-d5a0-4743-990c-a13cbcfe4f94","2373b609-44af-4f10-9977-cf5f34e757f2","16928631707f369cea","83b79a83-0f36-4b69-8d1c-f7817ec66957"]}