{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"459d44e5-dcef-497b-9d6f-0dd996845b33":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/Michael-Arthur_our-story1_1200x_1200x_c2e44c70-cfd8-480e-aec5-52ca51e932f2.webp","image_mask":"none","image2_mask":"none","subtitle":"","title":"Our Story","text":"<p>Our CEO & Founder, Michael Fallah, has been designing and handcrafting jewellery for over 20 years. He began his apprenticeship at the age of 16 where he discovered a knack for creating beautiful jewellery. Continually evolving and shining in creativity, his passion and enthusiastic attitude is evident in every fine detail of his creations.<br\/>After working in the jewellery industry for many years and gaining his experience in the field, Michael realised that there was something missing. A direct connection between the jeweller and the customer.<br\/><\/p><p>From this, the idea of allowing the customer to have a one on one relationship with the jeweller emerged; bringing to life a whole original concept where they are involved in every step of the process. Right from the selection of the diamond, to the type of gold\/ platinum they desire in their intricate design. Michael truly believes that educating his clients is key and with an ever-growing international client base an idea to bring this experience into the modern world via the internet came to life. Not only allowing his local following to take part in this process, but anyone, anywhere on the globe. <br\/><\/p><p><\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"66","layout":"left","divider":false,"top_padding":true,"bottom_padding":true,"lazyload_images":false}},"8a441864-3562-4fbb-8b23-be72fbf23f7f":{"type":"rich-text","blocks":{"template--19293830283562__8a441864-3562-4fbb-8b23-be72fbf23f7f-168518358922344b52-1":{"type":"text","settings":{"enlarge_text":true,"text":"<p>\"My aim is to ensure the client makes an educated decision in selecting the finest quality to suit their budget. I always want to ensure they feel confident in their decision so we cover everything from colour, clarity, cut and carat weight during the decision making process. Allowing them to understand exactly what they are purchasing is key.”<br\/>– Michael Arthur<\/p>"}}},"block_order":["template--19293830283562__8a441864-3562-4fbb-8b23-be72fbf23f7f-168518358922344b52-1"],"settings":{"align_text":"center","narrow_column":true,"divider":false}},"234eff82-5ceb-431f-95db-4f1972f0d760":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/Michael-Arthur_our-story2_1200x_1200x_3477bf8b-0cef-4fe8-8d4d-f5510b21a799.webp","image_mask":"none","image2_mask":"none","subtitle":"","title":"The Brand","text":"<p>The Michael Arthur style appeals to the modern girl or guy who strives for that ‘sophisticated with a side of cool’ vibe. The minimalist and clean designs of the engagement and wedding rings can be complemented by the sleek and contemporary ready to wear earrings, bracelets, necklaces and pendants. The brand allows room for every individual to be themselves by putting their own twist on the ever loved designs. <\/p><p>In accordance with the diversity movement happening in our world today, Michael Arthur aims to celebrate the individual. Each customer is invited to let go of the traditional method of finding that perfect piece and get a taste of the unique VIP Michael Arthur experience; allowing them to proudly be different. Whether that be in person or online. You can be anywhere in the world and still have the privilege of partaking in this truly amazing experience. <\/p><p><\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"66","layout":"right","divider":false,"top_padding":true,"bottom_padding":true,"lazyload_images":false}}},"order":["main","459d44e5-dcef-497b-9d6f-0dd996845b33","8a441864-3562-4fbb-8b23-be72fbf23f7f","234eff82-5ceb-431f-95db-4f1972f0d760"]}